# SQL Murder Mystery

## Can you find out whodunnit?

![A decorative illustration of a detective looking at an evidence board.](https://mystery.knightlab.com/174092-clue-illustration.png)

There's been a Murder in SQL City! The SQL Murder Mystery is designed to be both a self-directed lesson to learn SQL concepts and commands and a fun game for experienced SQL users to solve an intriguing crime.

## SQL sleuths start here

A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a **​murder​** that occurred sometime on ​**Jan.15, 2018​** and that it took place in ​**SQL City​**. Start by retrieving the corresponding crime scene report from the police department’s database.

### Exploring the Database Structure

Experienced SQL users can often use database queries to infer the structure of a database. But each database system has different ways of managing this information. The SQL Murder Mystery is built using SQLite. Use this SQL command to find the tables in the Murder Mystery database.

Run this query to find the names of the tables in this database.

This command is specific to SQLite. For other databases, you'll have to learn their specific syntax.

In [83]:
# Install required packages
%pip install jupysql sqlalchemy pandas --quiet

# Load SQL magic
%load_ext sql

# Connect to the database
%sql sqlite:///sql-murder-mystery.db
#%config SqlMagic.style = 'table'

Note: you may need to restart the kernel to use updated packages.
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [84]:
%%sql
SELECT name
FROM sqlite_master

Running query in 'sqlite:///sql-murder-mystery.db'

+---------------------------------------+
|                  name                 |
+---------------------------------------+
|           crime_scene_report          |
|            drivers_license            |
|         facebook_event_checkin        |
|               interview               |
|           get_fit_now_member          |
| sqlite_autoindex_get_fit_now_member_1 |
|          get_fit_now_check_in         |
|                solution               |
|             check_solution            |
|                 income                |
+---------------------------------------+
Truncated to displaylimit of 10.


Besides knowing the table names, you need to know how each table is structured. The way this works is also dependent upon which database technology you use. Here's how you do it with SQLite.

Run this query to find the structure of the `crime_scene_report` table

Change the value of 'name' to see the structure of the other tables you learned about with the previous query.

In [85]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'crime_scene_report'

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------------------------------+
|                sql                |
+-----------------------------------+
| CREATE TABLE crime_scene_report ( |
|               date integer,       |
|                 type text,        |
|             description text,     |
|                 city text         |
|                   )               |
+-----------------------------------+


### The rest is up to you!

If you're really comfortable with SQL, you can probably get it from here. To help, here is the schema diagram:

![schema diagram](schema.png)

Use your knowledge of the database schema and SQL commands to find out who committed the murder.

In [86]:
%%jupysql
select * from crime_scene_report
where city = 'SQL City' and date <= 20180115 and date >= 20180101

Running query in 'sqlite:///sql-murder-mystery.db'

+----------+---------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------+
|   date   |   type  |                                                                                        description                                                                                        |   city   |
+----------+---------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------+
| 20180103 | bribery |                                                              Apparently, Cayde thought it necessary to expose this extremely                                                              | SQL City |
|          |         |                                                                               rare vegetable to a Hive summoning ritual.                                                                  |          |
| 20180115 | assault |                                                        Hamilton: Lee, do you yield? Burr: You shot him in the side! Yes he yields!                                                        | SQL City |
| 20180115 | assault |                                                                                      Report Not Found                                                                                     | SQL City |
| 20180115 |  murder | Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave". | SQL City |
+----------+---------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------+

In [87]:
%%jupysql
select * from person
where (name like '%Annabel%' and address_street_name = 'Franklin Ave')
order by address_number desc;

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+----------------+------------+----------------+---------------------+-----------+
|   id  |      name      | license_id | address_number | address_street_name |    ssn    |
+-------+----------------+------------+----------------+---------------------+-----------+
| 16371 | Annabel Miller |   490173   |      103       |     Franklin Ave    | 318771143 |
+-------+----------------+------------+----------------+---------------------+-----------+

In [88]:
%%jupysql
SELECT *
 FROM person
 WHERE address_street_name = 'Northwestern Dr'
 ORDER BY address_number DESC
 LIMIT 1

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+----------------+------------+----------------+---------------------+-----------+
|   id  |      name      | license_id | address_number | address_street_name |    ssn    |
+-------+----------------+------------+----------------+---------------------+-----------+
| 14887 | Morty Schapiro |   118009   |      4919      |   Northwestern Dr   | 111564949 |
+-------+----------------+------------+----------------+---------------------+-----------+

In [89]:
%%jupysql
select * from interview
where person_id = 16371 or person_id = 14887

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| person_id |                                                                                                            transcript                                                                                                           |
+-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|   14887   | I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W". |
|   16371   |                                                      I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.                                                      |
+-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [90]:
%%jupysql
select * from get_fit_now_member
where (membership_status = 'gold' and id like '48Z%') or name = 'Annabel Miller'

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+-----------+----------------+-----------------------+-------------------+
|   id  | person_id |      name      | membership_start_date | membership_status |
+-------+-----------+----------------+-----------------------+-------------------+
| 48Z7A |   28819   |  Joe Germuska  |        20160305       |        gold       |
| 48Z55 |   67318   | Jeremy Bowers  |        20160101       |        gold       |
| 90081 |   16371   | Annabel Miller |        20160208       |        gold       |
+-------+-----------+----------------+-----------------------+-------------------+

In [91]:
%%jupysql
select * from get_fit_now_check_in
where (membership_id = '48Z7A' or membership_id = '48Z55' or membership_id = '90081' ) and check_in_date = 20180109

Running query in 'sqlite:///sql-murder-mystery.db'

+---------------+---------------+---------------+----------------+
| membership_id | check_in_date | check_in_time | check_out_time |
+---------------+---------------+---------------+----------------+
|     48Z7A     |    20180109   |      1600     |      1730      |
|     48Z55     |    20180109   |      1530     |      1700      |
|     90081     |    20180109   |      1600     |      1700      |
+---------------+---------------+---------------+----------------+

In [92]:
%%jupysql
select * from person
where (id = 28819 or id = 67318)

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+---------------+------------+----------------+-----------------------+-----------+
|   id  |      name     | license_id | address_number |  address_street_name  |    ssn    |
+-------+---------------+------------+----------------+-----------------------+-----------+
| 28819 |  Joe Germuska |   173289   |      111       |        Fisk Rd        | 138909730 |
| 67318 | Jeremy Bowers |   423327   |      530       | Washington Pl, Apt 3A | 871539279 |
+-------+---------------+------------+----------------+-----------------------+-----------+

In [93]:
%%jupysql
select * from drivers_license
where (id = 173289 or id = 423327) and plate_number like '%H42W%'

Running query in 'sqlite:///sql-murder-mystery.db'

+--------+-----+--------+-----------+------------+--------+--------------+-----------+-----------+
|   id   | age | height | eye_color | hair_color | gender | plate_number |  car_make | car_model |
+--------+-----+--------+-----------+------------+--------+--------------+-----------+-----------+
| 423327 |  30 |   70   |   brown   |   brown    |  male  |    0H42W2    | Chevrolet |  Spark LS |
+--------+-----+--------+-----------+------------+--------+--------------+-----------+-----------+


### Check your solution

Did you find the killer? When you think you know the answer, submit your suspect using the following code and find out if you're right.

In [94]:
%%sql
INSERT INTO solution VALUES (1, 'Jeremy Bowers');
SELECT value FROM solution;

Running query in 'sqlite:///sql-murder-mystery.db'

1 rows affected.

+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                                                                               value                                                                                                                                                                                                |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murderer to find the real villain behind this crime. If you feel especially confident in your SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer. |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

### Challenge Part

In [95]:
%%jupysql
select * from interview where person_id = 67318

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| person_id |                                                                                                                    transcript                                                                                                                    |
+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|   67318   | I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5" (65") or 5'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017. |
|           |                                                                                                                                                                                                                                                  |
+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [96]:
%%jupysql
select * from drivers_license
where (height >=65 and height <= 67) and hair_color = 'red' and car_make = 'Tesla' and car_model = 'Model S' and gender = 'female'

Running query in 'sqlite:///sql-murder-mystery.db'

+--------+-----+--------+-----------+------------+--------+--------------+----------+-----------+
|   id   | age | height | eye_color | hair_color | gender | plate_number | car_make | car_model |
+--------+-----+--------+-----------+------------+--------+--------------+----------+-----------+
| 202298 |  68 |   66   |   green   |    red     | female |    500123    |  Tesla   |  Model S  |
| 291182 |  65 |   66   |    blue   |    red     | female |    08CM64    |  Tesla   |  Model S  |
| 918773 |  48 |   65   |   black   |    red     | female |    917UU3    |  Tesla   |  Model S  |
+--------+-----+--------+-----------+------------+--------+--------------+----------+-----------+

In [103]:
%%jupysql
select id,license_id,name,ssn from person
where (license_id = 202298 or license_id = 291182 or license_id = 918773)

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+------------+------------------+-----------+
|   id  | license_id |       name       |    ssn    |
+-------+------------+------------------+-----------+
| 78881 |   918773   |     Red Korb     | 961388910 |
| 90700 |   291182   |  Regina George   | 337169072 |
| 99716 |   202298   | Miranda Priestly | 987756388 |
+-------+------------+------------------+-----------+

In [98]:
%%jupysql
select * from facebook_event_checkin
where (person_id = 78881 or person_id = 90700 or person_id = 99716) and event_name like '%SQL%'

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+----------+----------------------+----------+
| person_id | event_id |      event_name      |   date   |
+-----------+----------+----------------------+----------+
|   99716   |   1143   | SQL Symphony Concert | 20171206 |
|   99716   |   1143   | SQL Symphony Concert | 20171212 |
|   99716   |   1143   | SQL Symphony Concert | 20171229 |
+-----------+----------+----------------------+----------+

In [101]:
%%sql
INSERT INTO solution VALUES (1, 'Miranda Priestly');
SELECT value FROM solution;

Running query in 'sqlite:///sql-murder-mystery.db'

1 rows affected.

+--------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                            value                                                                             |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Congrats, you found the brains behind the murder! Everyone in SQL City hails you as the greatest SQL detective of all time. Time to break out the champagne! |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [104]:
%%jupysql
select * from income where ssn = 987756388

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+---------------+
|    ssn    | annual_income |
+-----------+---------------+
| 987756388 |     310000    |
+-----------+---------------+